normaltext = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz1234567890\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~"

guntextfont = "▄︻デA̷B̷C̷D̷E̷F̷G̷H̷I̷J̷K̷L̷M̷N̷O̷P̷Q̷R̷S̷T̷U̷V̷W̷X̷Y̷Z̷a̷b̷c̷d̷e̷f̷g̷h̷i̷j̷k̷l̷m̷n̷o̷p̷q̷r̷s̷t̷u̷v̷w̷x̷y̷z̷1̷2̷3̷4̷5̷6̷7̷8̷9̷0̷\̷"̷'̷#̷$̷%̷&̷(̷)̷*̷+̷,̷-̷.̷/̷:̷;̷<̷=̷>̷?̷@̷[̷\̷\̷]̷^̷_̷`̷{̷|̷}̷~̷══━一"

illuminatifont = "𓂀 𝔸𝔹ℂ𝔻𝔼𝔽𝔾ℍ𝕀𝕁𝕂𝕃𝕄ℕ𝕆ℙℚℝ𝕊𝕋𝕌𝕍𝕎𝕏𝕐ℤ𝕒𝕓𝕔𝕕𝕖𝕗𝕘𝕙𝕚𝕛𝕜𝕝𝕞𝕟𝕠𝕡𝕢𝕣𝕤𝕥𝕦𝕧𝕨𝕩𝕪𝕫𝟙𝟚𝟛𝟜𝟝𝟞𝟟𝟠𝟡𝟘\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~ 𓂀"

squaretextfont = "🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉1234567890\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~"

fattextfont = "ᗩᗷᑕᗪᗴᖴǤᕼᎥᒎᛕᒪᗰᑎᗝᑭɊᖇᔕ丅ᑌᐯᗯ᙭Ƴ乙ᗩᗷᑕᗪᗴᖴǤᕼᎥᒎᛕᒪᗰᑎᗝᑭɊᖇᔕ丅ᑌᐯᗯ᙭Ƴ乙1234567890\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~"

mirrorfont = "ɐqɔpǝɟƃɥᴉɾʞlɯuodbɹsʇnʌʍxʎzɐqɔpǝɟƃɥᴉɾʞlɯuodbɹsʇnʌʍxʎzƖᄅƐㄣϛ9ㄥ860\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~"

asainfont = "卂乃匚ᗪ乇千Ꮆ卄丨ﾌҜㄥ爪几ㄖ卩Ɋ尺丂ㄒㄩᐯ山乂ㄚ乙卂乃匚ᗪ乇千Ꮆ卄丨ﾌҜㄥ爪几ㄖ卩Ɋ尺丂ㄒㄩᐯ山乂ㄚ乙1234567890\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~"

russianfont = "АБCДЄFGHЇJКГѪЙѲPФЯ$TЦѴШЖЧЗабcдёfgнїjкгѫпѳpфя$тцѵщжчз1234567890\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~"

squigglefont = "ꋫꃃꏸꁕꍟꄘꁍꑛꂑꀭꀗ꒒ꁒꁹꆂꉣꁸ꒓ꌚ꓅ꐇꏝꅐꇓꐟꁴꋫꃃꏸꁕꍟꄘꁍꑛꂑꀭꀗ꒒ꁒꁹꆂꉣꁸ꒓ꌚ꓅ꐇꏝꅐꇓꐟꁴ1234567890\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~"

superscriptfont = "ᴬᴮᶜᴰᴱᶠᴳᴴᴵᴶᴷᴸᴹᴺᴼᴾQᴿˢᵀᵁⱽᵂˣʸᶻᵃᵇᶜᵈᵉᶠᵍʰⁱʲᵏˡᵐⁿᵒᵖqʳˢᵗᵘᵛʷˣʸᶻ¹²³⁴⁵⁶⁷⁸⁹⁰\"'#$%&⁽⁾*⁺,⁻./:;<⁼>?@[\\]^_`{|}~"

subscriptfont = "ₐBCDₑFGHᵢⱼKLMNₒPQᵣSTᵤᵥWₓYZₐ𝚋𝚌𝚍ₑfg𝓱ᵢⱼ𝓴ᄂᗰ𝚗ₒ𝐩qᵣ𝘴𝚝ᵤᵥwₓyz₁₂₃₄₅₆₇₈₉₀\"'#$%&₍₎*₊,₋./:;<₌>?@[\\]^_`{|}~"

underlinefont = "A̲B̲C̲D̲E̲F̲G̲H̲I̲J̲K̲L̲M̲N̲O̲P̲Q̲R̲S̲T̲U̲V̲W̲X̲Y̲Z̲a̲b̲c̲d̲e̲f̲g̲h̲i̲j̲k̲l̲m̲n̲o̲p̲q̲r̲s̲t̲u̲v̲w̲x̲y̲z̲1̲2̲3̲4̲5̲6̲7̲8̲9̲0̲\̲"̲'̲#̲$̲%̲&̲(̲)̲*̲+̲,̲-̲.̲/̲:̲;̲<̲=̲>̲?̲@̲[̲\̲\̲]̲^̲_̲`̲{̲|̲}̲~̲"

blockframedfont = "【A】【B】【C】【D】【E】【F】【G】【H】【I】【J】【K】【L】【M】【N】【O】【P】【Q】【R】【S】【T】【U】【V】【W】【X】【Y】【Z】【a】【b】【c】【d】【e】【f】【g】【h】【i】【j】【k】【l】【m】【n】【o】【p】【q】【r】【s】【t】【u】【v】【w】【x】【y】【z】【1】【2】【3】【4】【5】【6】【7】【8】【9】【0】【\】【"】【'】【#】【$】【%】【&】【(】【)】【*】【+】【,】【-】【.】【/】【:】【;】【<】【=】【>】【?】【@】【[】【\】【\】【]】【^】【_】【`】【{】【|】【}】【~】"

blackbubblefont = "🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩1234567890\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~"

hwcapitalfont = "𝓐𝓑𝓒𝓓𝓔𝓕𝓖𝓗𝓘𝓙𝓚𝓛𝓜𝓝𝓞𝓟𝓠𝓡𝓢𝓣𝓤𝓥𝓦𝓧𝓨𝓩𝓪𝓫𝓬𝓭𝓮𝓯𝓰𝓱𝓲𝓳𝓴𝓵𝓶𝓷𝓸𝓹𝓺𝓻𝓼𝓽𝓾𝓿𝔀𝔁𝔂𝔃1234567890\"'#$%&()*+,-./:;<=>?@[\\]^_`{|}~"

ZALG_LIST = [["̖", " ̗", " ̘", " ̙"," ̜", " ̝", " ̞", " ̟", " ̠", " ̤", " ̥"," ̦", " ̩"," ̪", " ̫", " ̬", " ̭", " ̮", " ̯", " ̰", " ̱", " ̲", " ̳"," ̹"," ̺", " ̻"," ̼", " ͅ"," ͇"," ͈", " ͉"," ͍"," ͎"," ͓", " ͔", " ͕"," ͖"," ͙", " ͚", " ", ],
             [" ̍"," ̎", " ̄", " ̅"," ̿"," ̑", " ̆", " ̐"," ͒"," ͗"," ͑", " ̇"," ̈", " ̊", " ͂", " ̓"," ̈́"," ͊"," ͋"," ͌", " ̃",  " ̂", " ̌"," ͐"," ́"," ̋"," ̏"," ̽", " ̉", " ͣ", " ͤ", " ͥ", " ͦ"," ͧ"," ͨ"," ͩ"," ͪ"," ͫ", " ͬ"," ͭ", " ͮ"," ͯ", " ̾", " ͛", " ͆"," ̚",],
             [" ̕", " ̛", " ̀"," ́"," ͘", " ̡", " ̢"," ̧"," ̨"," ̴", " ̵"," ̶"," ͜", " ͝"," ͞"," ͟"," ͠"," ͢"," ̸"," ̷"," ͡",]
            ]

musicalfont = ['♬', 'ᖲ', '¢', 'ᖱ', '៩', '⨏', '❡', 'Ϧ', 'ɨ', 'ɉ', 'ƙ', 'ɭ', '៣', '⩎', '០', 'ᖰ', 'ᖳ', 'Ʀ', 'ន', 'Ƭ', '⩏','⩔', 'Ɯ', '✗', 'ƴ', 'Ȥ',
              '♬', 'ᖲ', '¢', 'ᖱ', '៩', '⨏', '❡', 'Ϧ', 'ɨ', 'ɉ', 'ƙ', 'ɭ', '៣', '⩎', '០', 'ᖰ', 'ᖳ', 'Ʀ', 'ន', 'Ƭ', '⩏', '⩔', 'Ɯ', '✗', 'ƴ','Ȥ',
              '0', '1', '2', '3', '4','5', '6', '7', '8', '9', '_', "'", ',', '\\', '/', '!', '?']


normiefont = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u',
              'v', 'w', 'x', 'y', 'z']
    
EMOJIS = [
    "😂", "😂", "👌", "💞", "👍", "👌", "💯","🎶","👀", "😂", "👓", "👏", "👐", "🍕", "💥",    "😩", "😏", "😞", "👀",  "👅", "😩",  "🤒", "😳",  "🤯",  "😵", "🥵", "🤒", "😠", "😪", "😴",  "🤤",  "👿",  "👽",  "😏", "😒", "😣",  "🤔",  "🤨", "🧐", "😝", "🤪", "🤩", "☺️", "😭", "🥺",
       ]

